{
  "articles": [
    {
      "id": "https://developers.googleblog.com/architecting-efficient-context-aware-multi-agent-framework-for-production/",
      "title": "Architecting efficient context-aware multi-agent framework for production",
      "source": "Google Developers",
      "url": "https://developers.googleblog.com/architecting-efficient-context-aware-multi-agent-framework-for-production/",
      "published_at": "",
      "fetched_at": "2025-12-05T04:28:17.127815",
      "tags": [],
      "summary": "ADK introduces **Context Engineering** to scale AI agents beyond large context windows. It treats context as a compiled view over a tiered, stateful system (**Session, Memory, Artifacts**). This architecture uses explicit processors for transformation, enables efficient compaction and caching, and allows for strict, scoped context handoffs in multi-agent workflows to ensure reliability and cost-effectiveness in production.",
      "notes": ""
    },
    {
      "id": "https://developers.googleblog.com/announcing-the-data-commons-gemini-cli-extension/",
      "title": "Announcing the Data Commons Gemini CLI extension",
      "source": "Google Developers",
      "url": "https://developers.googleblog.com/announcing-the-data-commons-gemini-cli-extension/",
      "published_at": "",
      "fetched_at": "2025-12-05T04:28:17.127815",
      "tags": [],
      "summary": "The new Data Commons extension for the Gemini CLI makes accessing public data easier. It allows users to ask complex, natural-language questions to query Data Commons' public datasets, grounding LLM responses in authoritative sources to reduce AI hallucinations. Data Commons is an organized library of public data from sources like the UN and World Bank. The extension enables instant data analysis, exploration, and integration with other data-related extensions.",
      "notes": ""
    },
    {
      "id": "https://developers.googleblog.com/new-gemini-api-updates-for-gemini-3/",
      "title": "New Gemini API updates for Gemini 3",
      "source": "Google Developers",
      "url": "https://developers.googleblog.com/new-gemini-api-updates-for-gemini-3/",
      "published_at": "",
      "fetched_at": "2025-12-05T04:28:17.127815",
      "tags": [],
      "summary": "Gemini 3 is available via API with updates for developers: new `thinking_level` for depth control, `media_resolution` for multimodal processing, and enforced `Thought Signatures` for agentic workflows, especially with function calling and image generation. It also introduces combining Google Search/URL Grounding with Structured Outputs and new usage-based pricing for Grounding. Best practices, like using default temperature, are advised for optimal results.",
      "notes": ""
    },
    {
      "id": "https://developers.googleblog.com/unlocking-peak-performance-on-qualcomm-npu-with-litert/",
      "title": "Unlocking Peak Performance on Qualcomm NPU with LiteRT",
      "source": "Google Developers",
      "url": "https://developers.googleblog.com/unlocking-peak-performance-on-qualcomm-npu-with-litert/",
      "published_at": "",
      "fetched_at": "2025-12-05T04:28:17.127815",
      "tags": [],
      "summary": "LiteRT's new Qualcomm AI Engine Direct (QNN) Accelerator unlocks dedicated NPU power for on-device GenAI on Android. It offers a unified mobile deployment workflow, SOTA performance (up to 100x speedup over CPU), and full model delegation. This enables smooth, real-time AI experiences, with FastVLM-0.5B achieving over 11,000 tokens/sec prefill on Snapdragon 8 Elite Gen 5 NPU.",
      "notes": ""
    },
    {
      "id": "https://developers.googleblog.com/build-with-google-antigravity-our-new-agentic-development-platform/",
      "title": "Build with Google Antigravity, our new agentic development platform",
      "source": "Google Developers",
      "url": "https://developers.googleblog.com/build-with-google-antigravity-our-new-agentic-development-platform/",
      "published_at": "",
      "fetched_at": "2025-12-05T04:28:17.127815",
      "tags": [],
      "summary": "Introducing Google Antigravity, a new agentic development platform for orchestrating code. It combines an AI-powered Editor View with a Manager Surface to deploy agents that autonomously plan, execute, and verify complex tasks across your editor, terminal, and browser. Agents communicate progress via Artifacts (screenshots, recordings) for easy verification. Available now in public preview.",
      "notes": ""
    },
    {
      "id": "https://developers.googleblog.com/jules-gemini-3/",
      "title": "Building with Gemini 3 in Jules",
      "source": "Google Developers",
      "url": "https://developers.googleblog.com/jules-gemini-3/",
      "published_at": "",
      "fetched_at": "2025-12-05T04:28:17.127815",
      "tags": [],
      "summary": "Jules, an always-on, multi-step software development agent, now features Gemini 3, offering clearer reasoning and better reliability. Recent improvements include parallel CLI runs, a stable API, and safer Git handling. Upcoming features include directory attachment without GitHub and automatic PR creation. Jules aims to reduce software writing overhead so developers can focus on building.",
      "notes": ""
    },
    {
      "id": "https://developers.googleblog.com/building-ai-agents-with-google-gemini-3-and-open-source-frameworks/",
      "title": "Building AI Agents with Google Gemini 3 and Open Source Frameworks",
      "source": "Google Developers",
      "url": "https://developers.googleblog.com/building-ai-agents-with-google-gemini-3-and-open-source-frameworks/",
      "published_at": "",
      "fetched_at": "2025-12-05T04:28:17.127815",
      "tags": [],
      "summary": "Gemini 3 Pro Preview is introduced as a powerful, agentic model for complex, (semi)-autonomous workflows. New agentic features include `thinking_level` for reasoning control, Stateful Tool Use via Thought Signatures, and `media_resolution` for multimodal fidelity. It has Day 0 support for open-source frameworks like LangChain, AI SDK, LlamaIndex, Pydantic AI, and n8n. Best practices include simplifying prompts and keeping temperature at 1.0.",
      "notes": ""
    },
    {
      "id": "https://developers.googleblog.com/building-production-ai-on-google-cloud-tpus-with-jax/",
      "title": "Building production AI on Google Cloud TPUs with JAX",
      "source": "Google Developers",
      "url": "https://developers.googleblog.com/building-production-ai-on-google-cloud-tpus-with-jax/",
      "published_at": "",
      "fetched_at": "2025-12-05T04:28:17.127815",
      "tags": [],
      "summary": "The JAX AI Stack is a modular, industrial-grade, end-to-end machine learning platform built on the core JAX library, co-designed with Cloud TPUs. It features key components like JAX, Flax, Optax, and Orbax for foundational model development, plus an extended ecosystem for the full ML lifecycle and production. This integration provides a powerful, scalable foundation for AI development, delivering significant performance advantages.",
      "notes": ""
    },
    {
      "id": "https://developers.googleblog.com/5-things-to-try-with-gemini-3-pro-in-gemini-cli/",
      "title": "5 things to try with Gemini 3 Pro in Gemini CLI",
      "source": "Google Developers",
      "url": "https://developers.googleblog.com/5-things-to-try-with-gemini-3-pro-in-gemini-cli/",
      "published_at": "",
      "fetched_at": "2025-12-05T04:28:17.127815",
      "tags": [],
      "summary": "Gemini 3 Pro is now integrated into Gemini CLI, unlocking state-of-the-art reasoning, agentic coding, and advanced tool use for enhanced developer productivity. It's available now for Google AI Ultra and paid Gemini API key subscribers (upgrade CLI to 0.16.x). Features include generating 3D apps and code from visual sketches, running complex shell commands, creating documentation, and debugging live Cloud Run services.",
      "notes": ""
    },
    {
      "id": "https://developers.googleblog.com/making-the-terminal-beautiful-one-pixel-at-a-time/",
      "title": "Making the terminal beautiful one pixel at a time",
      "source": "Google Developers",
      "url": "https://developers.googleblog.com/making-the-terminal-beautiful-one-pixel-at-a-time/",
      "published_at": "",
      "fetched_at": "2025-12-05T04:28:17.127815",
      "tags": [],
      "summary": "Google has launched the redesigned **Android AI Sample Catalog**, a dedicated, open-source application to inspire and educate Android developers on building AI-powered apps. It showcases examples using both on-device (Gemini Nano via ML Kit GenAI API) and Cloud models (via Firebase AI Logic SDK), including image generation with Imagen, on-device summarization, and a \"Chat with Nano Banana\" chatbot. The code is easy to copy and paste to help developers quickly start their own projects.",
      "notes": ""
    },
    {
      "id": "https://developers.googleblog.com/introducing-metrax-performant-efficient-and-robust-model-evaluation-metrics-in-jax/",
      "title": "Introducing Metrax: performant, efficient, and robust model evaluation metrics in JAX",
      "source": "Google Developers",
      "url": "https://developers.googleblog.com/introducing-metrax-performant-efficient-and-robust-model-evaluation-metrics-in-jax/",
      "published_at": "",
      "fetched_at": "2025-12-05T04:28:17.127815",
      "tags": [],
      "summary": "Metrax is a high-performance JAX-based metrics library developed by Google. It standardizes model evaluation by offering robust, efficient metrics for classification, NLP, and vision, eliminating manual re-implementation after migrating from TensorFlow. Key strengths include parallel computation of \"at K\" metrics (e.g., PrecisionAtK) for multiple K values and strong integration with the JAX AI Stack, leveraging JAX's performance features. It is open-source on GitHub.",
      "notes": ""
    },
    {
      "id": "https://developers.googleblog.com/introducing-code-wiki-accelerating-your-code-understanding/",
      "title": "Introducing Code Wiki: Accelerating your code understanding",
      "source": "Google Developers",
      "url": "https://developers.googleblog.com/introducing-code-wiki-accelerating-your-code-understanding/",
      "published_at": "",
      "fetched_at": "2025-12-05T04:28:17.127815",
      "tags": [],
      "summary": "Code Wiki is a new platform that tackles the bottleneck of reading existing code by providing an automated, continuously updated, structured wiki for code repositories. It features hyper-linked documentation, a Gemini-powered chat agent that understands your repo, and automated diagrams. A public preview is available for open-source projects, and a Gemini CLI extension is coming soon for secure use on private repos.",
      "notes": ""
    },
    {
      "id": "https://developers.googleblog.com/google-colab-is-coming-to-vs-code/",
      "title": "Google Colab is Coming to VS Code",
      "source": "Google Developers",
      "url": "https://developers.googleblog.com/google-colab-is-coming-to-vs-code/",
      "published_at": "",
      "fetched_at": "2025-12-05T04:28:17.127815",
      "tags": [],
      "summary": "Google Colab has launched an official VS Code extension, bridging the gap between the popular code editor and the AI/ML platform. The extension combines VS Code's powerful development environment with Colab's seamless access to high-powered runtimes (GPUs/TPUs), allowing users to connect local notebooks to Colab. This aims to meet developers where they are and brings the best of both worlds.",
      "notes": ""
    },
    {
      "id": "https://developers.googleblog.com/announcing-user-simulation-in-adk-evaluation/",
      "title": "Announcing User Simulation in ADK Evaluation",
      "source": "Google Developers",
      "url": "https://developers.googleblog.com/announcing-user-simulation-in-adk-evaluation/",
      "published_at": "",
      "fetched_at": "2025-12-05T04:28:17.127815",
      "tags": [],
      "summary": "The new **User Simulation** feature in the Agent Development Kit (ADK) replaces rigid, brittle manual test scripts with dynamic, LLM-powered conversation generation. Developers define a high-level `conversation_plan`, and the simulator handles the multi-turn interaction to achieve the goal. This dramatically reduces test creation time, builds more resilient tests, and creates a reliable regression suite for AI agents.",
      "notes": ""
    },
    {
      "id": "https://developers.googleblog.com/announcing-the-agent-development-kit-for-go-build-powerful-ai-agents-with-your-favorite-languages/",
      "title": "Announcing the Agent Development Kit for Go: Build Powerful AI Agents with Your Favorite Languages",
      "source": "Google Developers",
      "url": "https://developers.googleblog.com/announcing-the-agent-development-kit-for-go-build-powerful-ai-agents-with-your-favorite-languages/",
      "published_at": "",
      "fetched_at": "2025-12-05T04:28:17.127815",
      "tags": [],
      "summary": "The Agent Development Kit (ADK), an open-source, code-first toolkit for building powerful and sophisticated AI agents, now supports Go. ADK moves LLM orchestration and agent behavior directly into your code, giving you robust debugging, versioning, and deployment freedom. ADK for Go is idiomatic and performant, leveraging Go's strengths, and includes support for over 30+ databases and the Agent-to-Agent (A2A) protocol for collaborative multi-agent systems. Start building today!",
      "notes": ""
    },
    {
      "id": "https://developers.googleblog.com/agent-garden-samples-for-learning-discovering-and-building/",
      "title": "Agent Garden - Samples for learning, discovering and building",
      "source": "Google Developers",
      "url": "https://developers.googleblog.com/agent-garden-samples-for-learning-discovering-and-building/",
      "published_at": "",
      "fetched_at": "2025-12-05T04:28:17.127815",
      "tags": [],
      "summary": "Agent Garden is now available to all users to simplify AI agent creation and deployment using the Agent Development Kit (ADK). It provides curated agent samples, one-click deployment via Agent Starter Pack, and customization through Firebase Studio. It helps developers with complex business challenges and multi-agent workflows, with Renault Group cited as an early success story.",
      "notes": ""
    },
    {
      "id": "https://developers.googleblog.com/beyond-request-response-architecting-real-time-bidirectional-streaming-multi-agent-system/",
      "title": "Beyond Request-Response: Architecting Real-time Bidirectional Streaming Multi-agent System",
      "source": "Google Developers",
      "url": "https://developers.googleblog.com/beyond-request-response-architecting-real-time-bidirectional-streaming-multi-agent-system/",
      "published_at": "",
      "fetched_at": "2025-12-05T04:28:17.127815",
      "tags": [],
      "summary": "The blog post argues the request-response model fails for advanced multi-agent AI. It advocates for a real-time bidirectional streaming architecture, implemented by the Agent Development Kit (ADK). This streaming model enables true concurrency, natural interruptibility, and unified multimodal processing. ADK's core features are real-time I/O management, stateful sessions for agent handoffs, and streaming-native tools.",
      "notes": ""
    },
    {
      "id": "https://developers.googleblog.com/introducing-the-jules-extension-for-gemini-cli/",
      "title": "Introducing the Jules extension for Gemini CLI",
      "source": "Google Developers",
      "url": "https://developers.googleblog.com/introducing-the-jules-extension-for-gemini-cli/",
      "published_at": "",
      "fetched_at": "2025-12-05T04:28:17.127815",
      "tags": [],
      "summary": "Introducing the Jules extension for Gemini CLI, an autonomous sidekick for developers. It accelerates coding workflows by offloading tasks like asynchronous work, bug fixes, and changes in new branches to Jules, while you stay in flow with Gemini CLI. Get started by installing the extension and using the /jules command to initiate and check task statuses.",
      "notes": ""
    },
    {
      "id": "https://developers.googleblog.com/say-hello-to-a-new-level-of-interactivity-in-gemini-cli/",
      "title": "Say hello to a new level of interactivity in Gemini CLI",
      "source": "Google Developers",
      "url": "https://developers.googleblog.com/say-hello-to-a-new-level-of-interactivity-in-gemini-cli/",
      "published_at": "",
      "fetched_at": "2025-12-05T04:28:17.127815",
      "tags": [],
      "summary": "We&#x27;re excited to announce an enhancement to Gemini CLI that makes your workflow more powerful a...",
      "notes": ""
    },
    {
      "id": "https://developers.googleblog.com/introducing-coral-npu-a-full-stack-platform-for-edge-ai/",
      "title": "Introducing Coral NPU: A full-stack platform for Edge AI",
      "source": "Google Developers",
      "url": "https://developers.googleblog.com/introducing-coral-npu-a-full-stack-platform-for-edge-ai/",
      "published_at": "",
      "fetched_at": "2025-12-05T04:28:17.127815",
      "tags": [],
      "summary": "Coral NPU is a full-stack platform for Edge AI, addressing performance, fragmentation, and user trust deficits. It's an AI-first architecture, prioritizing ML matrix engines, and offers a unified developer experience. Designed for ultra-low-power, always-on AI in wearables and IoT, it enables contextual awareness, audio/image processing, and user interaction with hardware-enforced privacy. Synaptics is the first partner to implement Coral NPU.",
      "notes": ""
    },
    {
      "id": "https://developers.googleblog.com/mediatek-npu-and-litert-powering-the-next-generation-of-on-device-ai/",
      "title": "MediaTek NPU and LiteRT: Powering the next generation of on-device AI",
      "source": "Google Developers",
      "url": "https://developers.googleblog.com/mediatek-npu-and-litert-powering-the-next-generation-of-on-device-ai/",
      "published_at": "",
      "fetched_at": "2025-12-09T00:19:35.539316",
      "tags": [],
      "summary": "LiteRT and MediaTek are announcing the new LiteRT NeuroPilot Accelerator. This is a ground-up successor for the TFLite NeuroPilot delegate, bringing seamless deployment experience, state-of-the-art LLM support, and advanced performance to millions of devices worldwide.",
      "notes": ""
    },
    {
      "id": "https://developers.googleblog.com/dont-trust-verify-building-end-to-end-confidential-applications-on-google-cloud/",
      "title": "Don't Trust, Verify: Building End-to-End Confidential Applications on Google Cloud",
      "source": "Google Developers",
      "url": "https://developers.googleblog.com/dont-trust-verify-building-end-to-end-confidential-applications-on-google-cloud/",
      "published_at": "",
      "fetched_at": "2025-12-10T00:20:06.678944",
      "tags": [],
      "summary": "Google Cloud enables end-to-end confidential applications, protecting sensitive data 'in-use' with hardware isolation. The solution combines Confidential Space (TEE/attestation), Oak Functions (private sandbox), and Oak Session (attested end-to-end encryption for scale). This framework anchors user trust in open-source components, proving confidentiality for sensitive workloads like proprietary GenAI models, even when running behind untrusted load balancers.",
      "notes": ""
    },
    {
      "id": "https://developers.googleblog.com/pick-up-exactly-where-you-left-off-with-session-management-in-gemini-cli/",
      "title": "Pick up exactly where you left off with Session Management in Gemini CLI",
      "source": "Google Developers",
      "url": "https://developers.googleblog.com/pick-up-exactly-where-you-left-off-with-session-management-in-gemini-cli/",
      "published_at": "",
      "fetched_at": "2025-12-11T00:20:18.618980",
      "tags": [],
      "summary": "Gemini CLI's new automatic **Session Management** (v0.20.0+) saves your conversation history, tool outputs, and reasoning, providing project-specific context. Resume easily using the **Interactive Session Browser** (`/resume`) or command-line flags (`--resume`). This feature ensures you never lose your work state, capturing prompts, tool execution details, and usage stats. Customize history with cleanup policies in `settings.json`.",
      "notes": ""
    },
    {
      "id": "https://developers.googleblog.com/building-agents-with-the-adk-and-the-new-interactions-api/",
      "title": "Building agents with the ADK and the new Interactions API",
      "source": "Google Developers",
      "url": "https://developers.googleblog.com/building-agents-with-the-adk-and-the-new-interactions-api/",
      "published_at": "",
      "fetched_at": "2025-12-12T00:20:11.508341",
      "tags": [],
      "summary": "The new Gemini Interactions API enables stateful, multi-turn AI agent workflows, providing a single interface for raw models and the Gemini Deep Research Agent. It can be integrated with existing ADK systems as a superior inference engine with simplified state management, or used as a transparent remote A2A agent via InteractionsApiTransport, allowing seamless expansion of multi-agent systems with minimal refactoring.",
      "notes": ""
    },
    {
      "id": "https://developers.googleblog.com/introducing-a2ui-an-open-project-for-agent-driven-interfaces/",
      "title": "Introducing A2UI: An open project for agent-driven interfaces",
      "source": "Google Developers",
      "url": "https://developers.googleblog.com/introducing-a2ui-an-open-project-for-agent-driven-interfaces/",
      "published_at": "",
      "fetched_at": "2025-12-16T00:20:41.579998",
      "tags": [],
      "summary": "A2UI is an open-source project for agent-driven, cross-platform, and generative UI. It provides a secure, declarative data format for agents to compose bespoke interfaces from a trusted component catalog, allowing for native styling and incremental updates. Designed for the multi-agent mesh (A2A), it offers a framework-agnostic solution to safely render remote agent UIs, with integrations in AG UI, Flutter's GenUI SDK, Opal, and Gemini Enterprise.",
      "notes": ""
    },
    {
      "id": "https://developers.googleblog.com/developers-guide-to-multi-agent-patterns-in-adk/",
      "title": "Developer’s guide to multi-agent patterns in ADK",
      "source": "Google Developers",
      "url": "https://developers.googleblog.com/developers-guide-to-multi-agent-patterns-in-adk/",
      "published_at": "",
      "fetched_at": "2025-12-17T00:19:51.422424",
      "tags": [],
      "summary": "Learn how to build modular and reliable agentic applications using 8 effective multi-agent design patterns with the Agent Development Kit (ADK).",
      "notes": ""
    },
    {
      "id": "https://developers.googleblog.com/gemini-3-flash-is-now-available-in-gemini-cli/",
      "title": "Gemini 3 Flash is now available in Gemini CLI",
      "source": "Google Developers",
      "url": "https://developers.googleblog.com/gemini-3-flash-is-now-available-in-gemini-cli/",
      "published_at": "",
      "fetched_at": "2025-12-18T00:17:40.842623",
      "tags": [],
      "summary": "Gemini 3 Flash is now available in Gemini CLI. It delivers Pro-grade coding performance with low latency and a lower cost, matching Gemini 3 Pro's SWE-bench Verified score of 76%. It significantly outperforms 2.5 Pro, improving auto-routing and agentic coding. It's ideal for high-frequency development tasks, handling complex code generation, large context windows (like processing 1,000 comment pull requests), and generating load-testing scripts quickly and reliably.",
      "notes": ""
    },
    {
      "id": "https://developers.googleblog.com/introducing-agent-development-kit-for-typescript-build-ai-agents-with-the-power-of-a-code-first-approach/",
      "title": "Introducing Agent Development Kit for TypeScript: Build AI Agents with the Power of a Code-First Approach",
      "source": "Google Developers",
      "url": "https://developers.googleblog.com/introducing-agent-development-kit-for-typescript-build-ai-agents-with-the-power-of-a-code-first-approach/",
      "published_at": "",
      "fetched_at": "2025-12-18T00:17:40.842623",
      "tags": [],
      "summary": "Introducing the Agent Development Kit (ADK) for TypeScript, an open-source framework for building complex, multi-agent AI systems with a code-first approach. Developers can define agent logic in TypeScript, applying traditional software development best practices (version control, testing). ADK offers end-to-end type safety, modularity, and deployment-agnostic functionality, leveraging the familiar TypeScript/JavaScript ecosystem.",
      "notes": ""
    },
    {
      "id": "https://developers.googleblog.com/conductor-introducing-context-driven-development-for-gemini-cli/",
      "title": "Conductor: Introducing context-driven development for Gemini CLI",
      "source": "Google Developers",
      "url": "https://developers.googleblog.com/conductor-introducing-context-driven-development-for-gemini-cli/",
      "published_at": "",
      "fetched_at": "2025-12-19T00:20:27.861578",
      "tags": [],
      "summary": "Conductor is a new Gemini CLI extension that promotes context-driven development. It shifts project context from chat logs to persistent Markdown files for formal specs and plans, ensuring AI agents adhere to project goals, style, and tech stack. This structured workflow is great for \"brownfield\" projects and teams, allowing for safe iteration and consistent code contributions while keeping the human developer in control.",
      "notes": ""
    },
    {
      "id": "https://developers.googleblog.com/real-world-agent-examples-with-gemini-3/",
      "title": "Real-World Agent Examples with Gemini 3",
      "source": "Google Developers",
      "url": "https://developers.googleblog.com/real-world-agent-examples-with-gemini-3/",
      "published_at": "",
      "fetched_at": "2025-12-20T00:19:32.093173",
      "tags": [],
      "summary": "Gemini 3 is powering the next generation of reliable, production-ready AI agents. This post highlights 6 open-source framework collaborations (ADK, Agno, Browser Use, Eigent, Letta, mem0), demonstrating practical agentic workflows for tasks like deep search, multi-agent systems, browser and enterprise automation, and stateful agents with advanced memory. Clone the examples and start building today.",
      "notes": ""
    }
  ]
}